import urllib.parse
import os,os.path,json,sys
import requests
import time
import base64
import lilyfun  #导入同路径下的函数
#----------------1.初始化读取数据----------------------
aa="{'words_result': [{'words': '例言'}, {'words': '(一)本书共收浙江省临海市'}, {'words': '(包括历史上原属临海,近已划归'}, {'words': '台州市椒江区的部分)建国后迄今'}, {'words': '出土的墓志114方。这些墓志,以'}, {'words': '时代分,计宋54、元6、明53、清1。'}, {'words': '例言'}, {'words': '(二)著录主要依据是石本或'}, {'words': '拓片,也有少数原石已失,则参用'}, {'words': '录文。其中二方系市博物馆的旧'}, {'words': '藏拓片,因从未公开发表,故予附'}, {'words': '入。凡此皆于志后说明中注出。'}, {'words': '(三)目录编排,基本上以撰志'}, {'words': '年代先后为序,如无撰志年代,则'}, {'words': '按志主下葬年代或卒年。但遇志'}, {'words': '主为同一家族成员,为使资料更具'}, {'words': '连续性,则按先后编排一起。'}, {'words': '(四)标题统一先示朝代,再具'}, {'words': '志主姓名,后列该志所标之体裁,'}, {'words': '如圹志、圹记、墓记、墓志、墓表、圹'}, {'words': '前志、岁月记、权厝记、墓志铭、生'}, {'words': '坟记等。志主若系女性,则于其前'}, {'words': '加上其夫或子、孙名,以便查考。'}, {'words': '一律不用爵衔尊号美称。'}, {'words': '(五)文字统一分段标点,原有'}, {'words': '抬头空格一律不用。遇原分行处,'}, {'words': '则标以行款号“」”。如无石本根'}], 'words_result_num': 27, 'log_id': 1480535865406307811}"




print(aa)
jsonarr = json.loads(aa)
print(jsonarr["log_id"])



#----------------3.数据写入json文件-------------------
#lilyfun.savearr2json(arr,"key")


